app/controllers/reviews_controller.rb

  def index

    @product = Product.find_by_id(params[:product_id])
    if  @product.present?
      @reviews =   @product.reviews
    else
    @reviews = Review.all
---
SELECT `products`.* FROM `products` WHERE `products`.`id` IS NULL LIMIT 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1

  def show
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1

  def edit
    @review = Review.find(params[:id])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1

  def create

    @product = Product.find(params[:product_id])
    @review = @product.reviews.new(params[:review])

    respond_to do |format|
      if @review.save
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 15 LIMIT 1
INSERT INTO `reviews` (`created_at`, `description`, `product_id`, `rating`, `sumary`, `updated_at`, `user_id`) VALUES ('2012-08-24 15:19:16', 'description review 2', NULL, 3, 'sumary 2', '2012-08-24 15:19:16', NULL)

  def update
    @review = Review.find(params[:id])

    respond_to do |format|
      if @review.update_attributes(params[:review])
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 5 LIMIT 1
UPDATE `reviews` SET `sumary` = 'sumary3 para producto 1', `updated_at` = '2012-08-26 19:10:00' WHERE `reviews`.`id` = 8