app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`mail` = 'amparomegias@hotmail.com' LIMIT 1
---
  def create

    @user = User.find_by_mail(params[:email])